Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ལྷག་པའི་བསམ་དང་ལྡན་པའི་སེམས།
en: His mind, with its excellent intentions,

source: །བྱང་ཆུབ་ལས་ཀྱང་མི་ལྡོག་གོ།
en: Never turns back from awakening.’

source: །དེ་ནས་ལྷ་གཞན་ཞིག་གིས་དེ་ལ་སྨྲས་པ། མཆེ་བ་ཕྱུང་བ་ལས་བྱུང་བའི། །སྡུག་བསྔལ་རང་གིས་མྱོང་ཡང་དེའི།
en: “Then another god said to that one: “ ‘Even experiencing the pain Caused by pulling out his tusks, Why would his merciful mind, Which intends to gladden

source: །སྙིང་རྗེ་དམྱལ་བ་ལ་གནས་པའི། །སེམས་ཅན་རྣམས་ལ་མངོན་འཕེལ་བ། །གང་དག་ཡིན་པ་དེ་ཡི་སེམས།
en: Even beings living in hell,

source: །བྱང་ཆུབ་ལས་ལྡོག་ག་ལ་འགྱུར།
en: Turn back from awakening?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་མཆེ་བ་དེ་དག་ཕྱུང་ནས་རང་ཉིད་ཐོགས་ཏེ་ཅང་མི་སྨྲ་བར་འདུག་གོ། །དེ་ནས་རྔོན་པ་མི་དགའ་བ་སྐྱེས་ཏེ།
en: “Then the Bodhisattva, having pulled out his tusks and holding them to himself, remained silent.

source: ཅི་འདིས་རང་གི་མཆེ་བ་དེ་དག་བཟུང་ནས་སྦྱིན་པར་གཏོང་མི་འདོད་དམ་སྙམ་མོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དེའི་བསམ་པ་ཤེས་ནས་མེ་ཏོག་ཀུན་ད་ལྟ་བུའི་སྣ་མངོན་དུ་བརྐྱང་ནས་གྲོགས་པོ་བག་མ་ཚ་ཞིག་ཅེས་སྨྲས་ཏེ།
en: The hunter worried, ‘Why is he holding these tusks of his, not giving them away?’ The Bodhisattva understood his thought and stretched out his trunk, which was just like a white lily flower. He said, ‘Friend, do not worry:

source: ཀུ་མུ་ད་དང་ཟླ་བ་དང་། །པད་མའི་རྩ་འདྲ་མཆེ་བའི་མཆོག །དྲུག་པོ་འདི་དག་ཁྱོད་སྦྱིན་ཞེས། །བདག་གིས་བཟུང་གིས་བདེ་བར་འདུག །སྐད་ཅིག་ཙམ་ཞིག་སྡོད་ཅིག་དང་། །ལེན་པ་པོ་དང་ཉེ་བར་ནི།
en: “ ‘I am happy because I have pulled out these six excellent tusks, Which are just like a white lily, the moon, and lotus roots, In order to give them to you. “ ‘Wait for a while.

source: །དེ་ཡི་བར་དུ་སྡུག་བསྔལ་གྱིས།
en: Beside you, who are the recipient,

source: །གདུངས་པའི་ཡིད་རབ་དང་བར་བྱ།
en: I will meanwhile purify my mind, Which is tormented by pain.

source: །གལ་ཏེ་ཁྱོད་ནི་ཅི་སྟེ་བདག་བརྟགས་ནས།
en: “ ‘If, having observed me,

source: །ཁྱོད་ཀྱིས་སེམས་ནི་རབ་ཏུ་དང་བར་བྱ།
en: You think, “The mind should be purified. I must understand

source: །བདག་ནི་གསོད་འཁུ་གཡོན་ཅན་ངོ་ཚ་མེད། །དེ་ལ་གོ་བར་གྱིས་ཤིག་སྙམ་སེམས་ན།
en: Killing to be a shameless monster,”

source: །ཁྱོད་ཀྱིས་ཉེས་སྤྱད་གདུག་དང་གཞུ་གདུག་པ།
en: “ ‘You should despise wrong, evil acts

source: །དེ་དང་མདའ་རྣོན་ཁྱད་དུ་བསད་ནས་ནི།
en: And the evil bow and sharp arrows.

source: །ངུར་སྨྲིག་འཕགས་པའི་རྒྱལ་མཚན་གྱུར་པ་དེ།
en: And, having looked at the saffron robe, which is the banner of the noble ones,

source: །མཐོང་ནས་ཡིད་ནི་རབ་ཏུ་དང་བར་བྱ།
en: You should purify your mind.

source: །སྦྱིན་པ་ཁ་ཅིག་ལེན་པ་ལས་འདག་སྟེ།
en: “ ‘One gift is pure because of its recipient;

source: །དེ་བཞིན་གཞན་ནི་སྦྱིན་པ་པོ་ལས་འདག །དེ་ཡི་ཕྱིར་ནི་འདིར་ནི་རང་སེམས་ལས།
en: Another is pure because of its donor. Therefore, make an effort

source: །ཡོན་གྱི་དག་པ་ཡང་དག་བསྐྱེད་པར་འབད།
en: To purify the gift with your mind.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་འདི་ནི་འདོད་ཆགས་དང་བྲལ་བའི་རྒྱལ་མཚན་ཡིན་ནོ་སྙམ་ནས་ངུར་སྨྲིག་དེ་ཉིད་ལ་རྟོག་ཅིང་སེམས་རབ་ཏུ་དང་བར་བྱས་ཏེ།
en: “Then the Bodhisattva, thinking that it was the banner of those who are free from desire, gazed at the saffron robe, and his mind was filled with faith.

source: མཆེ་བ་དེ་རྣམས་རང་གི་ལག་ནས་བྱིན་ནས་སྨྲས་པ།
en: He gave his tusks and said:

source: དུག་ཅན་མདའ་ཡིས་ཕོག་ནས་བདག་གི་སྙིང་ལ་ནི།
en: “ ‘Although I was shot with a poisoned arrow,

source: །མི་དགའ་ཅུང་ཟད་མ་གྱུར་བདེན་པ་གང་ཡིན་པའི།
en: There was no hatred in my heart.

source: །བདེན་པ་དེ་ཡིས་ཡང་དག་བྱང་ཆུབ་མཆོག་ཐོབ་ནས།
en: By this truth, I will attain complete and supreme awakening

source: །འགྲོ་བ་ཉམ་ཐག་སྡུག་བསྔལ་དག་ལས་ཡོངས་ཐར་བྱ།
en: And liberate miserable beings from suffering.’

source: དེའི་ཚེ་དེའི་དུས་ན་གླང་པོ་ཆེའི་རྒྱལ་པོ་མཆེ་བ་དྲུག་པར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: If you think that the one who was that six-tusked elephant king at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་གླང་པོ་ཆེའི་རྒྱལ་པོ་མཆེ་བ་དྲུག་པ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: I was the six-tusked elephant king at that time, on that occasion.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ན་ངས་བྱམས་པའི་སེམས་ཉེ་བར་བསྒྲུབས་པ་དང་། བྱ་དཀའ་བའི་སྦྱིན་པ་ཡོངས་སུ་བཏང་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening because I perfected thoughts of love and gave what was difficult to give, you should think otherwise;

source: འོན་ཀྱང་ངའི་བྱམས་པའི་སེམས་དང་གཏང་དཀའ་བའི་སྦྱིན་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་རྐྱེན་ཙམ་དང་ཚོགས་ཙམ་ཡིན་ནོ།
en: my thoughts of love and giving that which is difficult were only a cause, only a condition, only a preparation for supreme and complete awakening.” 2.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་རི་བོང་དུ་གྱུར་པ་ན་དྲང་སྲོང་ལ་བདག་ཉིད་ཀྱི་ཤ་བྱིན་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པ་ན་རི་ཁྲོད་ཆུ་མིག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། རྩ་བ་ཕུན་སུམ་ཚོགས་པ་ཞིག་ན་དྲང་སྲོང་དཀའ་ཐུབ་དྲག་པོ་ཅན་འབྲས་བུ་དང་རྩ་བ་དང་ཆུ་སྤྱོད་པ། གཡང་གཞི་དང་ཤིང་ཤུན་གྱོན་པ།
en: The Rabbit “Great King, again, when I was a rabbit, seeking supreme and complete awakening, I gave my own flesh to a brahmin. Listen to that story. “Great King, once in the past there lived a ṛṣi engaged in extreme ascetic practices: he ate fruits and roots and drank water, wore antelope skin and bark, and performed fire offerings on a mountain that was abundant in waterfalls, flowers, fruits, and roots.

source: མེའི་སྦྱིན་སྲེག་བྱེད་པ་ཞིག་གནས་སོ། །དྲང་སྲོང་དེའི་གྲོགས་པོ་རི་བོང་མིའི་སྐད་དུ་སྨྲ་བ་ཞིག་ཡོད་དེ།
en: This brahmin had a friend, a rabbit who spoke the language of humans.

source: དེ་ཉིན་པར་དྲང་སྲོང་གི་དྲུང་དུ་སོང་ནས་སོན་པ་དང་ཕྱག་བྱས་ཏེ་གཏམ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པར་མགུ་བར་བྱེད་པས་དེ་གཉིས་ཕ་དང་བུ་ཁོ་ན་བཞིན་དུ་སྡུག་པས་གནས་པར་གྱུར་ཏོ།
en: This rabbit used to go and greet the ṛṣi in the daytime, and please him with various conversations. Thus, these two grew to love each other like father and son.

source: །ཇི་ཙམ་དུས་འདས་པ་དང་ཐན་ཆེན་བྱུང་སྟེ། དེས་འབབ་ཆུ་དང་ཀླུང་རྣམས་ཆུ་ཆུང་བར་གྱུར་ཅིང་ཤིང་རྣམས་མེ་ཏོག་དང་འབྲས་བུར་མི་ལྡན་པར་གྱུར་ཏོ།
en: “After some time had passed, there was a bad drought, and therefore the waterfalls and rivers dried up and the trees did not bear any flowers or fruit.

source: །དེ་ནས་དྲང་སྲོང་དེ་བསྟི་གནས་དེ་ན་ཁ་ཟས་དང་བྲལ་བས་ལྷག་པར་དགའ་བར་མ་གྱུར་ནས།
en: Thus, the ṛṣi suffered greatly from a shortage of food in the hermitage.

source: དེས་གཡང་གཞི་དང་ཤིང་ཤུན་རྣམས་བསྡུ་བར་བརྩམས་སོ།
en: He began to collect antelope skins and bark.

source: །དེ་ནས་རི་བོང་གིས་དེ་དེ་ལྟ་བུ་ལ་ཞུགས་པ་མཐོང་ནས་དྲིས་པ། དྲང་སྲོང་ཆེན་པོ་གང་དུ་བཞུད།
en: Then the rabbit, having seen him doing so, asked, ‘O great ṛṣi, where are you going?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། གྲོང་འདབ་ཏུ་སོང་ལ་དེར་བཅོས་པའི་བསོད་སྙོམས་ཀྱིས་འཚོ་བར་བྱའོ།
en: “ ‘I will go to a village and eke out a living with cooked almsfood there,’ the ṛṣi answered.

source: །དེ་ནས་དེས་དྲང་སྲོང་གི་ཚིག་ཐོས་ནས་གདུང་བ་སྐྱེས་ཏེ་ཕ་མ་དང་བྲལ་བ་འདྲ་བར་སེམས་ཤིང་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་དྲང་སྲོང་དེ་ལ་སྨྲས་པ།
en: “Upon hearing the ṛṣi’s words, the rabbit was distressed. Feeling as if he had been separated from his parents, he threw himself at the ṛṣi’s feet and begged him, ‘Please do not abandon me!

source: བདག་མ་དོར་ཅིག །གཞན་ཡང་ཁྱིམ་ན་གནས་པ་ནི་ཉེས་པ་དུ་མས་དཀྲུགས་ཕ་ལགས་ལ། དགོན་པ་ན་གནས་པ་ནི་ཡོན་ཏན་དུ་མ་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །དེས་ལན་དུ་མ་སྨྲས་ན་ཡང་ལྡོག་ཏུ་མ་བཏུབ་ནས་དེ་ནས་རི་བོང་གིས་སྨྲས་པ།
en: Consider that those who live at home are corrupt because of numerous evils, whereas those who live in the wilderness are endowed with numerous good qualities.’ Although he repeated this many times, the rabbit was unable to dissuade the ṛṣi.

source: གལ་ཏེ་དེས་ན་འོན་ཀྱང་ཁྱོད་རེ་ཞིག་དེང་ལ་གཞེས་ལ་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་སང་བཞུད་ཅིག །དེ་ནས་དྲང་སྲོང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: So the rabbit said, ‘If it must be like this, please stay just for today and depart tomorrow as you like.’

source: འདིས་དེ་རིང་ངེས་པར་བདག་ཁ་ཟས་ལ་མགྲོན་དུ་འབོད་པར་འདོད་དེ།
en: “Then the ṛṣi thought, ‘Certainly he intends to invite me for a meal today.

source: འདི་ལྟར་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སྲོག་ཆགས་འདི་དག་ནི་སོགས་པ་ལ་བརྩོན་པ་ཡིན་ནོ་སྙམ་ནས་དེས་དེ་ལ་ཁས་བླངས་སོ།
en: Thus, these beings born in animal wombs make efforts to hoard up food.’ He promised the rabbit that he would stay.

source: །དེ་ནས་མེའི་སྤྱད་པ་བྱས་ནས་ཁ་ཟས་ཀྱི་དུས་ལ་བབ་པ་དང་རི་བོང་སོང་ནས། དྲང་སྲོང་དེ་ལ་བསྐོར་བ་བྱས་ཏེ་བཟོད་པ་གསོལ་བར་བརྩམས་པ།
en: “After that, the rabbit made a fire. When it was time for the meal, he went to the ṛṣi, circumambulated him, and begged his forgiveness:

source: དྲང་སྲོང་ཆེན་པོ་བདག་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པས་བླང་བ་དང་དོར་བ་མ་འཚལ་ནས་ཁྱོད་ལ་ནོངས་པ་ཅུང་ཟད་ཅི་བགྱིས་པ་བདག་ལ་བཟོད་པར་མཛོད་ཅིག །ཅེས་སྨྲས་ནས་དེ་མ་ཐག་ཏུ་མེའི་ནང་དུ་མཆོངས་སོ།
en: ‘O great ṛṣi, since I was born in an animal womb, I did not wish for what was received or discarded. Please forgive me for thus committing a small fault toward you.’ As soon as he said this, he threw himself into the fire.

source: །དེ་ནས་དྲང་སྲོང་དེ་མི་དགའ་བ་སྐྱེས་ཏེ་ངོམ་ཟུམ་གནག་ལ་མཆི་མ་ཟག་ཅིང་བུ་སྡུག་པ་གཅིག་པུ་ལ་བྱ་བ་བཞིན་དུ་འཁྱུད་ནས་སྨྲས་པ། བུ་འདི་ཅི་ཞིག་བྱེད་པར་བརྩམས།
en: “Then the brahmin became quite upset. Shedding tears, embracing the rabbit as if he were his beloved only son, he said, ‘My son, what were you trying to do?’

source: རི་བོང་གིས་སྨྲས་པ། དྲང་སྲོང་ཆེན་པོ་དགོན་པར་དགྱེས་པར་མཛོད་ལ་བདག་གི་ཤས་ཉིན་ཞག་གཅིག་གི་འཚོ་བ་མཛོད་ཅིག །གཞན་ཡང་།
en: “ ‘O great ṛṣi,’ said the rabbit, ‘please be satisfied with the wilderness and eke out a living for a day with my flesh. Again,

source: ནགས་སུ་སྐྱེས་པའི་རི་བོང་ལ་ནི་ཏིལ་དག་དང་། །མོན་སྲན་སྡེའུ་དང་འབྲས་ཐུག་ཆེན་པོ་ཅི་མ་མཆིས།
en: “ ‘Born in the forest, why does a rabbit not have sesame, Mudga beans, or much rice gruel?

source: །བདག་གི་ལུས་ནི་ཞུགས་སུ་ལེགས་པར་བསྒྲལ་བ་འདི།
en: Please, having eaten my body cooked in a fire,

source: །འདི་རུ་གསོལ་ལ་དེང་ལ་དཀའ་ཐུབ་ནགས་སུ་བཞུགས་པར་མཛོད།
en: Stay in the forest of ascetics for today.’

source: །དེ་ནས་དྲང་སྲོང་དེས་རི་བོང་གི་ཚིག་ཐོས་ནས་མི་དགའ་བ་སྐྱེས་ཏེ་སྨྲས་པ། གལ་ཏེ་དེ་ལྟ་ན་ཁྱོད་དགའ་བ་ལྟར་ཅི་བྱུང་བ་བྱུང་།
en: “When he heard the rabbit’s words, the ṛṣi grieved and said, ‘If that is how it is, I will abandon my life here, whatever may happen, so that you are pleased.

source: འདི་ཉིད་དུ་སྲོག་དོར་བར་བྱ་སྟེ་གྲོང་གི་མཐར་མི་འགྲོའོ།
en: I will not go to villages.’

source: །རི་བོང་གིས་ཚིག་དེ་ཐོས་ནས་ཡིད་དགའ་བར་གྱུར་ཏེ་མགོ་བསྟོད་ནས་ནམ་མཁའི་ངོས་ལོགས་སུ་བལྟས་ཏེ་གསོལ་བ་འདེབས་པར་ཞུགས་ཤིང་སྨྲས་པ།
en: “Upon hearing these words, the rabbit was pleased. He raised his head, looked up at the expanse of the sky, and prayed:

source: དགོན་པ་ལ་ནི་གནས་བཅས་ཏེ།
en: “ ‘I have lived in the wilderness

source: །བདག་ཉིད་དབེན་པ་ལ་དགའ་ན།
en: And been pleased with solitary places—

source: །བདེན་པའི་ཚིག་ནི་དེ་ཡིས་སུ།
en: By these words of truth,

source: །དབང་ཆེན་ལྷ་ཡིས་ཆར་ཕོབ་ཤིག །ཅེས་སྨྲས་པའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་དབང་པོ་ཆེན་པོའི་གནས་གཡོས་པར་གྱུར་ཏོ།
en: O Great Lord, may the gods bring rain.’ “The moment he said this, the residence of the Great Lord (Śakra) quaked on account of the Bodhisattva’s power.

source: །ལྷ་རྣམས་ཀྱི་ཤེས་པ་མཐོང་བ་ནི་འོག་ཏུ་འཇུག་པ་ཡིན་པས་ཅི་ལས་གྱུར་བལྟས་ན་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཡིན་ནས།
en: Since the knowledge of gods works downward, Śakra investigated what had caused this and found it was the Bodhisattva’s power.

source: ཇི་ཙམ་ན་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དབང་ཕྱུག་ཆེན་པོའི་ཆར་ཕབ་སྟེ། དེས་བསྟི་གནས་དེ་སླར་རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཏོ།
en: Then Śakra, Lord of the Gods, caused a torrential rain, so that the hermitage became abundant in grass, trees, herbs, flowers, and fruits as before.

source: །དེ་ནས་དྲང་སྲོང་དེས་དགེ་བའི་བཤེས་གཉེན་རི་བོང་ལ་བརྟེན་ནས་དེ་ན་གནས་ཏེ་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: “Thanks to his good friend the rabbit, the ṛṣi stayed there and actualized the five kinds of supernormal knowledge.

source: །དེ་ནས་དྲང་སྲོང་གིས་སྨྲས་པ། ཀྱེ་རི་བོང་བྱ་དཀའ་བའི་བརྩོན་འགྲུས་འདི་དང་། སྙིང་རྗེ་འདི་ལྟ་བུས་ཅི་ཞིག་དོན་དུ་གཉེར།
en: After that, the ṛṣi asked, ‘O rabbit, for what purpose did you undertake such a difficulty and show such mercy?’

source: དེས་སྨྲས་པ། འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་ཡོངས་སུ་འདྲེན་པ་མེད་པར་སེམས་ཅན་མ་རྒལ་བ་རྣམས་སྒྲོལ་བ་དང་མ་གྲོལ་བ་རྣམས་དགྲོལ་བ་དང་དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་འབྱིན་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བའི་སངས་རྒྱས་སུ་འགྱུར་བར་བྱའོ།
en: “The rabbit replied, ‘In the blind world that does not have a leader or instructor, may I become a buddha who liberates beings who have not been liberated, releases those who have not been released, relieves those who have not been relieved, and completely emancipates those who have not been emancipated.’

source: །དེ་ནས་དྲང་སྲོང་དེས་ཚིག་འདི་ཐོས་ནས་རི་བོང་ལ་སྨྲས་པ། གང་གི་ཚེ་ཁྱེད་སངས་རྒྱས་སུ་གྱུར་པ་དེའི་ཚེ་བདག་ལ་ཡང་དགོངས་ཤིག །རི་བོང་གིས་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིའོ།
en: “When he had heard these words, the ṛṣi requested the rabbit, ‘When you have become a buddha, please think of me.’ “ ‘I will do so,’ said the rabbit.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཇི་སྙམ་དུ་སེམས།
en: The Blessed One said, “What do you think, Great King?

source: དེའི་ཚེ་དེའི་དུས་ན་རི་བོང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རི་བོང་དེར་གྱུར་ཏེ།
en: I was the rabbit at that time, on that occasion.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ན་ངས་བྱ་དཀའ་བ་བདག་ཉིད་ཡོངས་སུ་བཏང་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by the difficult act of sacrificing myself, you should think otherwise;

source: འོན་ཀྱང་ངའི་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་རྐྱེན་ཙམ་དང་ཚོགས་ཙམ་ཡིན་ནོ།
en: that act of mine was only a cause, only a condition, only a preparation for supreme and complete awakening.” 3. Parents a. The Story of Śyāma

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་ཕ་དང་མ་ལོང་བ་ཕྲག་པས་ཁྱེར་བ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བ་རྒྱལ་སྲིད་བྱེད་དེ།
en: “Great King, again, seeking supreme and complete awakening, I carried my blind parents on my shoulders. Listen to that story. “Great King, once in the past a king called Brahmadatta was reigning in the city of Vārāṇasī.

source: འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་འཐབ་པ་དང་། ཐབ་མོ་དང་། ཁྲག་ཁྲུག་དང་། འགྱེད་པ་དང་། ཆོམ་རྐུན་མེད་ཅིང་ནད་རབ་ཏུ་ཞི་བར་གྱུར་པ། འབྲས་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་དང་། མ་ཧེ་ཕུན་སུམ་ཚོགས་པ་ལ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དོ།
en: A righteous king, he reigned in accordance with the Dharma over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people. There was no fighting, combat, dispute, strife, or robbers there, illness had abated, and it was abundant in rice, sugarcane, cattle, and buffalo.

source: །དེའི་མདུན་ན་འདོན་གྱི་བྲམ་ཟེ་དེའི་བུ་ལྗང་གུ་ཞེས་བྱ་བ་རིག་པའི་གནས་བཅྭ་བརྒྱད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། དད་པ་བཟང་བ། དགེ་བའི་བསམ་པ་ཅན། བདག་ལ་ཕན་པ་དང་གཞན་ལ་ཕན་པར་ཞུགས་པ། སྙིང་རྗེ་ཅན།
en: “His chief priest had a son named Śyāma, who had mastered the eighteen branches of science, was pious and good, had a virtuous disposition, acted for the benefit of himself and others, was merciful, and respected his parents.

source: ཕ་དང་མ་ལ་སྲི་ཞུ་བྱེད་པ་ཡོད་དེ་བུ་ནི་གཅིག་པུ་དེར་ཟད་ལ་ཕ་དང་མ་དེ་དག་ཀྱང་རྒས་ནས་མིག་ཉམས་ཏེ་མདོངས་ལ་ཐུག་པ་དང་། དེ་ནས་དེའི་ཕ་མས་རྒྱལ་པོ་ཚངས་སྦྱིན་ལ་གསོལ་པ།
en: He was their only son. The parents grew old and had poor eyesight, and they finally went blind.

source: རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་ལྗང་གུ་འདི་མདུན་ན་འདོན་དུ་དབང་བསྐུར་དུ་གསོལ།
en: The parents requested King Brahmadatta, ‘O Great King, please appoint our son, Śyāma, as chief priest.

source: བདག་ཅག་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་མཆི་ལགས་སོ།
en: We will go to the forest of ascetics.’

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གྱིས་ལྗང་གུ་ལ་སྨྲས་པ།
en: “Then King Brahmadatta ordered Śyāma, ‘Śyāma, assume the office of chief priest.’

source: ལྗང་གུ་ཁྱོད་མདུན་ན་འདོན་གྱིས་ཤིག་དེས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བདག་མདུན་ན་འདོན་པ་མི་འཚལ་ཏེ།
en: “ ‘O Great King,’ he answered, ‘I do not desire the post of chief priest.

source: བདག་ནི་རྒས་པ། ཉམ་ཆུང་བ། དབང་པོ་ཉམས་པ་རྣམས་ཀྱི་རིམ་གྲོ་འཚལ་བ་ལགས་སོ།
en: I would like to serve the old and weak whose faculties are feeble.’

source: །དེ་ནས་ལྗང་གུས་ཁྱིམ་ན་གནས་པ་དང་། མདུན་ན་འདོན་མཆིལ་མའི་ཐལ་བ་བཞིན་དུ་སྤངས་ནས་ཕ་མའི་གྲོགས་སུ་ནགས་ན་གནས་སོ།
en: “After that, having abandoned life at home and the post of chief priest as if they were spittle, Śyāma lived with his parents in the forest.

source: །དེ་ནང་པར་སྔར་ལངས་ནས་ཕ་དང་མ་གཉིས་ལ་སོ་ཤིང་དང་ཆུ་གཙང་མས་བསྙེན་བཀུར་བྱེད་དོ།
en: Every morning after waking up he offered toothpicks and clean water to his parents.

source: །དེ་ནས་དེའི་འོག་ཏུ་ལྷ་ལ་མེའི་སྦྱིན་སྲེག་གི་མཆོད་སྦྱིན་བྱས་ནས་ཕྱིས་འབྲས་བུ་དང་རྩ་བའི་ཕྱིར་ནགས་ཁྲོད་དུ་འཇུག་གོ།
en: Next, he performed fire offerings for the gods and then entered the dense forest to collect fruits and roots.

source: །དེ་ནས་འབྲས་བུ་དང་། རྩ་བ་དང་། ཆུ་བསིལ་བ་ཁྱེར་ཏེ་ཕ་མ་ལ་བྱིན་ནས་དེའི་འོག་ཏུ་ཕྱོགས་གཅིག་ཏུ་སོང་ནས་བསམ་གཏན་ལ་བརྩོན་པར་གནས་ཏེ་རིམ་པ་དེ་ལྟ་བུས་དུས་འདའ་བར་བྱེད་དོ།
en: He brought the fruits, roots, and cool water, and gave them to his parents. Only afterward did he go off to one side and devote himself to dhyāna. He spent his time occupied with this series of tasks.

source: །ཇི་ཙམ་ཉི་མ་གཞན་ཞིག་ལ་ནང་པར་སྔར་ལངས་ཏེ་ཕ་དང་མའི་རྐང་པ་གཉིས་ལ་ཕྱག་བྱས་ནས་གསོལ་ཏེ་རྨི་ལམ་དུ་ཡང་མཐོང་བ་རིག་པར་བྱེད་ཅིང་སྨྲས་པ།
en: One day, he woke up in the morning, paid homage at his parents’ feet, and explained what he had lucidly seen in a dream: “ ‘I saw in my dream

source: བདག་གི་གཡར་ལམ་སྦྲུལ་ནག་པོས།
en: A black snake eat up my body,

source: །བདག་ལུས་ཤིན་ཏུ་ཟོས་པ་དང་། །བདག་ནི་ཞགས་པ་ནག་པོ་ཡིས།
en: And myself caught in a black noose

source: །བཅིངས་ནས་ལྷོ་ཕྱོགས་ཁྲིད་པ་རྨིས།
en: And taken southward.

source: །གཡར་ལམ་འཇིགས་བྱེད་མཐོང་བདག་གི།
en: “ ‘I saw this terrifying dream.

source: །སྙིང་ལ་དོགས་པ་དེང་བདག་ལ། །བླ་མ་དང་བྲལ་ཤིན་ཏུ་ནི།
en: Thus, in my heart, fear arose

source: །མི་བཟད་འབྱུང་བར་འགྱུར་སྙམ་བགྱིད།
en: That an unbearable event would befall me today, Which is separation from my masters.’

source: །ཇི་ཙམ་ན་ཕ་མ་དེ་གཉིས་ཀྱི་དབུགས་ཕྱུང་ནས་ཉི་མ་ལ་ཁ་བལྟས་ཏེ་འདུག་ནས་བདེན་པས་གསོལ་བ་བཏབ་སྟེ་རིལ་བ་ཁྱེར་ནས་ཆུ་ལེན་དུ་སོང་ངོ་།
en: “After that, calmed by his parents, he sat down facing the sun, prayed with an appeal to truth, and went to draw water, carrying a water jar.

source: །དེའི་ཚེ་རྒྱལ་པོ་ཚངས་སྦྱིན་རི་དགས་འཆོར་དུ་ཆས་ཏེ་དཀའ་ཐུབ་ཀྱི་ནགས་དེར་ཞུགས་པ་དང་། རྒྱལ་པོ་དེ་སྒྲ་གྲགས་པར་ཕོག་པ་ཞིག་སྟེ།
en: At that time, King Brahmadatta had gone deer hunting and entered the forest of ascetics. The king was able to shoot at a sound.

source: དེས་རི་དགས་ཀྱི་སྒྲ་ལྟ་བུ་ཞིག་ཐོས་ནས་གཞུ་རྣ་དྲུང་དུ་བཀང་སྟེ་མདའ་འཕངས་པས་ལྗང་གུའི་སྙིང་གར་ཕོག་པར་གྱུར་ཏོ།
en: Hearing a sound like that of a deer, he fully drew his bow and shot an arrow, which pierced through Śyāma’s heart.

source: །དེ་ནས་མདས་གནད་དུ་ཕོག་པས་ས་ལ་འགྱེལ་ཀྱང་དེ་རང་གི་སྡུག་བསྔལ་ཁྱད་དུ་བསད་ནས་ཕ་མ་ཁོ་ནའི་མྱ་ངན་བྱེད་ཅིང་སྨྲས་པ། མདའ་གཅིག་བསྣུན་པས་བདག་དང་ནི།
en: Since a vital spot had been shot with the arrow, he fell to the ground. However, without any regard for his own pain, he grieved only for his parents:

source: །དབང་པོ་ཉམས་པར་གྱུར་པ་ཡི། །ཕ་དང་དེ་བཞིན་མ་དག་དང་། །བདག་ཅག་སྐྱེ་བོ་གསུམ་བསད་དོ།
en: “ ‘The three of us, namely, I and my parents, Whose faculties are impaired, Will all be killed

source: །དེ་ནས་རྒྱལ་པོས་དེ་ཐོས་ནས་འོངས་ཏེ་དྲིས་པ། ཅི་སྟེ་ངའི་མདའ་གཅིག་བསྣུན་པས་སྐྱེ་བོ་གསུམ་བསད།
en: Because one single arrow was shot.’ “When he heard this, the king approached and asked, ‘Why will three people be killed because one single arrow of mine was shot?’

source: དེ་ནས་ལྗང་གུ་སྙིང་རྗེ་རྗེ་སྐད་དུ་ངུས་ནས་རྒྱལ་པོ་ལ་སྨྲས་པ།
en: “Śyāma, weeping, answered the king in a piteous voice:

source: བདག་བས་ཆེས་ནི་ཉམ་ཆུང་བའི།
en: “ ‘Both my parents, who are much weaker than me,

source: །ཕ་མ་ཡང་ནི་ལྡོངས་པར་གྱུར།
en: Are blind.

source: །བདག་ཀྱང་མདའ་ཡིས་བསྣུན་པས་ན། །སྐྱེ་བོ་གསུམ་ནི་འཆི་བར་འགྱུར།
en: Therefore, three people will die Because I was shot with this arrow.’

source: །དེ་ནས་རྒྱལ་པོ་འཇིགས་ཤིང་སྐྲག་ལ་སྔངས་ནས་ལྗང་གུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then the king, alarmed and frightened, said to Śyāma, ‘O young brahmin, I have committed a sin.

source: །བྲམ་ཟེའི་ཁྱེའུ་ངས་ཉེས་པ་བྱས་ཏེ་མ་ཤེས་ནས་མདའ་འཕངས་ཀྱིས་ང་ལ་དམོད་པ་འདོར་དུ་མི་གཞུག་པར་ཕ་མ་ལ་གསོལ་བ་བྱ་བའི་རིགས་སོ།
en: I, without knowing this, shot the arrow. So please ask your parents not to lay a curse on me.’

source: །དེ་ནས་ལྗང་གུས་གུས་པ་དང་བཅས་པས་རྒྱལ་པོ་དབུགས་འབྱིན་པར་བྱེད་དེ།
en: “Śyāma respectfully reassured the king:

source: རྒྱལ་པོ་ཆེན་པོ་བདག་དང་ཉེ་བར་མཆིས་པ་རྣམས་ལ་དབང་ཞིག་མཆིས་ན་སྙིང་རྗེ་ཅན་དང་། སྐྱེ་བོ་ལ་བྱམས་པ་དང་། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བ་ལགས་པས་དམོད་པས་མ་བསྙེངས་ཤིག །ཡང་སྨྲས་པ། བདག་གི་བླ་མ་གང་ན་བར། །རིལ་བ་འདི་ནི་སྣོམས་མཛོད་ཅིག །དེ་དག་གི་ནི་རྐང་བཀྲུ་བ།
en: ‘O Great King, if I and my family have any ability, it is rather the ability to show mercy, love people, and consider the next life. So, you need not be afraid of any curse.’ “Further, he said: “ ‘Please take this water jar To my masters.

source: །ཐ་མ་འདི་ནི་ལགས་པར་འགྱུར།
en: This will be the last time To wash their feet.

source: །བདག་གི་ཚིག་གིས་རྐང་པ་ལ་ཕྱག་མཛོད་ལ་འདི་སྐད་རིང་པོར་མི་ཐོགས་པར་མཐར་ནི་གདོན་མི་ཟ་བར་འབྲལ་བར་འགྱུར་རོ་ཞེས་ཀྱང་གསུངས་ཤིག །དེ་ནས་རྒྱལ་པོ་རང་ཁོ་ནས་རིལ་བ་ཁྱེར་ཏེ་ནགས་ཁྲོད་དུ་ཆས་པ་དང་། དེའི་ཚེ་ཕྱོགས་བཞིར་མི་མ་ཡིན་པ་ཆེ་ཐང་དུ་འཁྲུགས་པར་གྱུར་ཏོ།
en: “ ‘Please pay homage at their feet on my behalf and say, “Soon we will certainly part from each other at last.” “Then the king, carrying the water jar himself, proceeded through the forest. At that time, large demons were making noises in every direction.

source: །དེ་ནས་ལོང་བ་དེ་གཉིས་གཅིག་ལ་གཅིག་སྨྲས་པ། ལྗང་གུ་འདི་ནི་མཚོའི་འགྲམ་དུ་རིང་མོ་ཞིག་ལོན་ནོ། །དེ་ནས་དེའི་མས་སྨྲས་པ།
en: The two blind people said to each other, ‘This Śyāma has been on the bank of the pond for a long time.’ Then his mother said:

source: ད་ལྟར་ཁོ་མོའི་ལྗང་གུ་དེ།
en: “ ‘My Śyāma is now playing

source: །པད་མ་ཨུཏྤལ་གང་བའི་མཚོ།
en: With animals In the pond that is full of padma and utpala,

source: །ངང་པ་སྒྲ་སྙན་འབྱིན་པ་ན། །རི་དགས་ལྷན་ཅིག་རྩེ་བར་བྱེད།
en: Where haṃsas are singing in a beautiful voice.’

source: །དེ་ནས་རྒྱལ་པོས་དྲུང་དུ་ཕྱིན་པ་དང་། དེའི་རྟིང་སྒྲ་ལས་དྲང་སྲོང་དེ་དག་གིས་སྨྲས་པ།
en: “After that, the king arrived. When they heard his footsteps, the ṛṣis said:

source: སྙིང་དུ་སྡུག་ཅིང་མཐོང་དགའ་བ།
en: “ ‘Śyāma, our beloved who is pleasing to the eye,

source: །ལྗང་གུ་ཅི་སྟེ་ནང་དུ་འཇུག །ཕ་མ་ཉམ་ཆུང་བཀྲེས་པ་ཡིས།
en: Although you are entering inside, Why do you oppress your parents

source: །ཉམ་ཐག་པ་ལ་ཅི་ཞིག་གཙེ།
en: Who are weak and overwhelmed by hunger?’

source: །དེ་ཡིད་མི་དགའ་ནས་སྙིང་རྗེ་རྗེ་སྐད་དུ་སྨྲས་པ། ཁོ་བོ་ནི་ལྗང་གུ་མ་ཡིན་གྱི་ཁོ་བོ་རྒྱལ་པོ་ཚངས་སྦྱིན་ནོ།
en: “The king felt sad and said in a piteous voice, ‘I am not Śyāma but King Brahmadatta.’

source: །བྱོན་པ་ལེགས་ཚུར་ཁྱོད་བདེ་འམ།
en: “ ‘Welcome! Are you well?

source: །གདན་འདི་ལ་ནི་བཞུགས་ཤིག་དང་། །ལྗང་གུ་ཆབ་དང་འབྲས་བུ་དག །ཐོགས་ནས་དེའུ་རེ་འདིར་མཆིའོ།
en: Please sit down on this seat. Śyāma will be here soon, Bringing water and fruits.

source: །མི་དབང་ལྗང་གུ་ཞེས་བགྱི་བ།
en: “ ‘O master of the people, Śyāma has good qualities

source: །ཡོན་ཏན་རྣམས་ལྡན་རང་བཞིན་བྱམས།
en: And is of a loving nature.

source: །དེ་ཡི་བྱམས་པའི་སྟོབས་ཀྱིས་འདིར།
en: Because of his power of love,

source: །རི་དགས་དང་ནི་བྱ་རྣམས་གནས།
en: Animals and birds stay here.’

source: །དེ་ནས་རྒྱལ་པོས་དྲང་སྲོང་གི་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་མཆི་མ་ཟག་ཅིང་སྐད་འདར་འདར་པོར་སྨྲས་པ། ལྗང་གུ་ནི་ནགས་ཚལ་འདིའི་ནང་དུ་སྙིང་ལ་མདས་ཕོག་སྟེ་སྲོག་གི་ལྷག་མ་ཅུང་ཟད་ཅིག་ལུས་ཤིང་འདུག་གོ།
en: “The king then threw himself at the feet of the ṛṣis and, shedding tears, said in a trembling voice, ‘Śyāma was shot with an arrow in the heart in this forest and is in the final moments of his life.
